Autodesk.Revit.DB.OverrideGraphicSettings.SetCutBackgroundPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the cut face background pattern override.
The fill pattern must be a drafting pattern.
A value of InvalidElementId means no override is set.
fillPatternId:
Value of the cut face background fill pattern override.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutForegroundPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the cut face foreground pattern override.
The fill pattern must be a drafting pattern.
A value of InvalidElementId means no override is set.
fillPatternId:
Value of the cut face foreground fill pattern override.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceBackgroundPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the surface background pattern override.
The fill pattern must be a drafting pattern.
A value of InvalidElementId means no override is set.
fillPatternId:
Value of the surface background fill pattern override.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceForegroundPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the surface foreground pattern override.
The fill pattern must be a drafting pattern.
A value of InvalidElementId means no override is set.
fillPatternId:
Value of the surface foreground fill pattern override.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutBackgroundPatternColor(Autodesk.Revit.DB.Color)
Sets the override color of the background pattern of cut faces.
color:
Value of the cut face background color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutForegroundPatternColor(Autodesk.Revit.DB.Color)
Sets the override color of the foreground pattern of cut faces.
color:
Value of the cut face foreground color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceBackgroundPatternColor(Autodesk.Revit.DB.Color)
Sets the override color of the surface background pattern.
color:
Value of the surface background color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceForegroundPatternColor(Autodesk.Revit.DB.Color)
Sets the override color of the surface foreground pattern.
color:
Value of the surface foreground color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutLinePatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the cut surface line pattern.
linePatternId:
ElementId of the cut surface line pattern for the override. InvalidElementId means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutLineColor(Autodesk.Revit.DB.Color)
Sets the cut surface line color.
color:
Value of the cut surface line color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionLinePatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the projection surface line pattern.
linePatternId:
ElementId of the projection surface line pattern for the override. InvalidElementId means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionLineColor(Autodesk.Revit.DB.Color)
Sets the projection surface line color.
color:
Value of the projection surface line color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.#ctor(Autodesk.Revit.DB.OverrideGraphicSettings)
Creates a new instance of an OverrideGraphicSettings object based on an existing OverrideGraphicSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014